# 13장 네트워크 디자인

- 네트워크 : 호스트와 호스트간 통신을 위해 연결된 망.
- 네트워크 디자인과 구성에 따라 호스트 간 통신 경로가 달라지고 서비스 품질에도 영향을 미침.
- 장애가 발생했을 때도 서비스 영향 범위나 회복 시간이 달라지고 전체적인 인프라 보안에도 영향을 미침.

## 13.1 2계층/3계층 네트워크

### 13.1.1 2계층 네트워크

- 2계층 네트워크는 이름 그대로 호스트 간 통신이 직접 2계층 통신만으로 이루어지는 네트워크 디자인.
- 2계층 통신을 하려면 통신할 호스트가 동일한 네트워크여야 함.
- 동일한 네트워크 간 통신이므로 게이트웨이를 거치지 않고 직접 호스트 간 통신이 가능한 구조.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123183436136.png" alt="image-20220123183436136" style="zoom:50%;" />

- 2계층 네트워크는 브로드캐스트 도메인이 되고 루프구조가 생기면 문제가 발생하므로 스패닝 트리 프로토콜을 이용해 문제를 해결함.

- STP사용으로 블록 포인트가 생기면서 전체 인프라의 대역폭을 사용하지 못하는 문제가 있음.

- 이 문제를 해결하려면 논블로킹 구조를 만들어야 함.

  <img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123183655740.png" alt="image-20220123183655740" style="zoom:50%;" />

### 13.1.2 3계층 네트워크

- 호스트 간 통신이 IP 라우팅과 같은 3계층 통신으로 이루어지는 네트워크 디자인.
- 라우팅으로 구성된 네트워크 구조이므로 루프 문제가 발생하지 않음.
- 3계층 네트워크로 디자인된 구성은 네트워크 장비 연결마다 다른 네트워크 장비에 연결되어 있다면 다른 네트워크를 갖게 됨.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123183858776.png" alt="image-20220123183858776" style="zoom:50%;" />

- VLAN과 같은 오버레이 네트워크 기술을 사용해 호스트 간에 동일한 네트워크를 사용하면서도 네트워크 장비간에 3계층 통신을 하도록 구성할 수 있음.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123184010011.png" alt="image-20220123184010011" style="zoom:50%;" />

## 13.2 3-Tier 아키텍처

- 코어(Core) - 애그리게이션(Aggregation) - 액세스(Access) 3계층으로 이루어진 네트워크 아키텍처는 전통적인 디자인 기법.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123184123659.png" alt="image-20220123184123659" style="zoom:50%;" />

- 엑세스 계층에 스위치가 있고, 엑세스 스위치를 중간에서 접선하는 애그리게이션 스위치가 그 상단에 있음. 코어 계층 스위치는 애그리게이션 스위치를 다시 모아 서로 통신할 수 있게 연결해줌.
- 상위 레이어로 올라갈수록 장비들이 집선되므로 높은 대역폭이 필요함.
- 데이터 센터의 경우, 3-Tier 네트워크 디자인은 서버 간 통신보다 사용자로부터 서비스를 요청받고 서버에서 사용자의 요청에 응답하는 North-South 트래픽이 대부분인 경우에 적합한 구조.

## 13.3 2-Tier 아키텍처

### 13.3.1 스파인-리프 구조

- 하단 호스트가 연결되는 리프 스위치는 상단 스파인 스위치와 연결됨.
- 리프 스위치와 스파인 스위치 간에는 전통적인 2계층 스패닝 트리가 동작하지 않고 모든 링크를 사용해 트래픽을 전송함.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123191117113.png" alt="image-20220123191117113" style="zoom:50%;" />

- 대용량 분산 처리 기술이 많이 사용되는 최근에는 데이터 센터 내부의 서버 간 통신량이 급증. 이러한 문제를 보완하기 위해 전통적인 3계층 아키텍처에서 스파인-리프 아키텍처로 네트워크 디자인 기법이 변하고 있음.

- 스파인-리프 네트워크 디자인에서는 동일 리프 스위치에 호스트가 연결된 경우를 제외하면 모든 호스트 간 통신 홉이 동일함. 출발

  지 리프 스위치를 지나 스파인 스위치를 거쳐 목적지 리프 스위치로 트래픽이 흘러 네트워크 흐름에 대한 홉 수가 짧아지고 트래픽 흐름이 일정해진다는 장점이 있음.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123191319927.png" alt="image-20220123191319927" style="zoom:50%;" />

- 서버 가상화, 빅데이터 대중화, 애플리케이션 아키텍처와 개발 방법의 변화.

### 13.3.2 L2 패브릭

- 스파인-리프 구조에서 스파인-리프 사이를 2계층 네트워크로 구성하는 방법. 
- L2 패브릭을 구성하기 위해 TRILL(TRansparent Interconnection of Lots of Links)이나 SPB(Shortest Path Bridging)와 같은 프로토콜을 사용할 수 있음. 
- 일반적인 2계층 구조에서는 루프에 대한 제약 때문에 모든 링크를 활성화할 수 없지만 TRILL이나 SPB와 같은 프로토콜은 이런 문제를 해결하도록 구현되어 있음.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123191654717.png" alt="image-20220123191654717" style="zoom:50%;" />

### 13.3.3 L3 패브릭

- 스파인-리프 구조에서 스파인과 리프 사이를 3계층 네트워크로 구성하는 방법. 
- 스파인과 리프가 연결된 링크는 각각 라우팅이 활성화되어 있고 일반적인 라우팅 프로토콜을 이용해 경로 정보를 교환함. 
- 라우팅으로 구성되어 있어 별도의 특별한 기술 없이도 루프를 제거하고 ECMP를 통해 모든 링크를 사용할 수 있음.

<img src="/Users/sungwonwi/Library/Application Support/typora-user-images/image-20220123191803316.png" alt="image-20220123191803316" style="zoom:50%;" />

## 13.4 데이터 센터 Zone/PoD 내부망/DMZ망/인터넷망

### 13.4.1 인터넷망

- 외부 인터넷에서 사용자가 데이터 센터에 접근할 수 있도록 구성된 영역을 인터넷망이라고 함.
- 인터넷망은 KT, LGU+, SKB와 같은 ISP(Internet Service Provider)에서 인터넷 회선을 받아 연동되어 있음. 
- 소규모 데이터 센터는 ISP에서 IP를 할당받아 인터넷에 쉽게 연결할 수 있지만 어느 정도 규모가 큰 데이터 센터는 ISP와 연동할 때, BGP 프로토콜을 이용하고 별도의 AS(Autonomous System) 번호를 갖고 있음. 
- 단일 회선을 가지고 있더라도 자신이 소유한 IP를 사용하려면 AS 번호를 할당받고 BGP 프로토콜을 이용해 ISP에 연결해야 함.
- 단일 회선으로 구성할수도 있지만 규모가 더 크다면 서비스 안정성을 위해 ISP 연결을 이중화하거나 삼중화함.

### 13.4.2 공인망(DMZ)

- 데이터 센터에서 외부 사용자에게 직접 노출되는 웹 서비스 등의 서버들이 모인 망. 
- 데이터 센터 외부 접근을 위해 공인 IP가 사용되어 공인망이라고 부르거나 서비스를 외부로 제공하므로 서비스망이라고도 부름. 
- 언트러스트(Untrust) 네트워크인 데이터센터 외부의 인터넷 구간과 트러스트(Trust) 네트워크인 데이터 센터 내부망의 연결 지점 역할을 하므로 군사분계선을 뜻하는 DMZ(DeMilitarized Zone)라고도 부름.

### 13.4.3 내부망(사내망/사설망)

- 공인망이나 DMZ망과 달리 데이터 센터 내부나 사내에서만 접근할 수 있는 네트워크. 
- 내부망은 일반적으로 사설 대역의 IP로 구성하므로 인터넷을 통한 외부망에서는 직접 접근할 수 없음. 
- 내부망 중 데이터 센터 관리나 내부 직원용 서버팜인 경우, 보안상 외부망과의 연결을 단절하거나 최소화해야 함. 
- 외부망과 통신할 때는 사설 IP로 통신할 수 없으므로 외부망으로 나가려면 중간에 공인 IP로 변환해주는 NAT가 필요. 
- 원격지에 있는 내부망 간 연결은 VPN이나 전용선으로 연결할 수 있습니다.

### 13.4.4 데이터베이스망

- 데이터베이스는 개인정보를 취급하는 경우가 많아 보안을 강화하기 위해 내부망에 데이터베이스망을 별도로 두기도 함. 
- 공인망으로부터 내부망을 보호하기 위해 방화벽을 두듯이 데이터베이스망도 내부망에서 접근할 때, 추가로 방화벽을 두고 별도 망을 구성할 수 있음. 
- 서버 간 통신이 아니면 보안을 더 강화하기 위한 접근 통제시스템을 운영하고 데이터베이스에 접속할 때는 접근 통제 시스템을
  통해야만 가능하도록 구성함.

### 13.4.5 대외망

- 회사 대 회사로 서비스 연동이 필요한 경우, 인터넷망을 통해 연동할 수도 있지만 별도 전용선이나 VPN을 이용해 서비스를 연동할 수 있음. 금융서비스와 같이 보안이 더 필요한 경우, 전용 회선과 VPN을 동시에 사용하기도 함. 이렇게 다른 대외사와의 연동을 위
  해 별도 망으로 분리하기도 함. 
- 이것은 대외사와 연동된 지점에서 사내로 접근할 때 서비스에 필요한 최소한의 접근만 허용하기 위함임.

### 13.4.6 관리망/OoB(Out of Band)

- 데이터 센터 내 서버나 네트워크 장비는 서비스를 위한 인터페이스도 있지만 장비 자체를 관리하기 위한 관리용 인터페이스를 별도로 제공하기도 함. 
- 네트워크 관리망과 서버 관리망은 목적이나 운영 방법에서 조금 다릅니다. 보통 네트워크 관리망은 장비 운용을 위
  한 CLI나 웹 접속을 위해 사용됨. 
- 일반 서비스망으로도 장비에 접근할 수 있어 관리망과 별도 서비스망 접근에는 큰 차이가 없음. 다만 서비스망과의 분리가 필요한 이유는 서비스망에 문제가 발생하더라도 서비스망과 별도로 분리된 관리망을 통해 장비에 접근해야 하기 때문.
- 서버 관리망은 일반적인 서비스망과 다릅니다. 서버 관리망은 하드웨어 자체를 관리하기 위한 별도의 환경입니다. 물론 해당 관리망을 통해 콘솔 접근이 가능하지만 기본적으로 하드웨어 자체를 관리하기 위한 환경이라고 생각하면 이해하기 쉬움.
